Repository: 1ucas/MochiDiffusion
Catalog: *.lproj/Localizable.strings
Languages: fi

source: %@ model
fi: %@ malli

source: ^[%lld images](inflect: true)
fi: ^[%lld kuvaa](inflect: true)

source: All
fi: Kaikki

source: Apply
fi: Käytä

source: Based on the option selected the correct model version will need to be used.
fi: Valitun vaihtoehdon perusteella on käytettävä oikeaa mallin versiota.

source: Check for Updates…
fi: Tarkista päivitykset…

source: Convert all images to High Resolution (this will use more memory)
fi: Muunna kaikki kuvat korkeaan resoluutioon (tämä käyttää enemmän muistia)

source: Convert to High Resolution
fi: Muunna korkeaksi resoluutioksi

source: Copy
fi: Kopioi

source: Copy Option to Sidebar
fi: Kopioi asetus sivupalkkiin

source: Copy Options to Sidebar
fi: Kopioi asetukset sivupalkkiin

source: CPU & GPU may be faster on M1 Max, Ultra and later but will use more memory.
fi: CPU & GPU voi olla nopeampi M1 Max, Ultra ja uudemmilla, mutta käyttää enemmän muistia.

source: CPU & Neural Engine provides a good balance between speed and low memory usage.
fi: CPU & Neural Engine tarjoaa hyvän tasapainon nopeuden ja muistinkäytön välillä.

source: Date
fi: Pvm

source: Description is too long
fi: Kuvaus on liian pitkä

source: Download Models
fi: Lataa Mallit

source: Exclude from Image
fi: Jätä pois kuvasta

source: Exclude from Image:
fi: Jätä pois kuvasta:

source: Filter Inappropriate Images
fi: Suodata sopimattomat kuvat

source: For `original` models, select Use GPU.
fi: Valitse "original" malleissa Käytä GPU.

source: For `split_einsum` models, select Use Neural Engine.
fi: Valitse "split_einsum"-malleissa Käytä Neural Engine.

source: Generate
fi: Generoi

source: Guidance Scale
fi: Ohjeiden Skaalaus

source: Guidance Scale:
fi: Ohjeiden Skaalaus:

source: Height:
fi: Korkeus:

source: Image
fi: Kuva

source: Image %lld of %lld
fi: Kuva %lld / %lld

source: Include in Image
fi: Sisällytä kuvaan

source: Include in Image:
fi: Sisällytä kuvaan:

source: Loading Model...
fi: Ladataan Mallia...

source: ML Compute Unit
fi: ML-laskentayksikkö

source: Model
fi: Malli

source: Model Folder
fi: Malli Kansio

source: Model:
fi: Malli:

source: No Info
fi: Ei tietoa

source: Number of Images:
fi: Kuvien määrä:

source: Open in Finder
fi: Avaa Finderissa

source: Quick Look
fi: Pikainen Vilkaisu

source: random
fi: satunnainen

source: Reduce Memory Usage
fi: Vähennä muistin Käyttöä

source: Reduce memory usage further at the cost of speed.
fi: Vähennä muistin käyttöä entisestään nopeuden kustannuksella.

source: Release Notes
fi: Julkaisutiedot

source: Remove
fi: Poista

source: Save All...
fi: Tallenna Kaikki...

source: Save As...
fi: Tallenna nimellä...

source: Scheduler
fi: Ajastus

source: Search
fi: Etsi

source: Searching: %@
fi: Etsitään: %@

source: Seed
fi: Seed-luku

source: Seed:
fi: Seed-luku:

source: Select Compute Unit option
fi: Valitse laskentayksikön valinta

source: Select Next
fi: Valitse Seuraava

source: Select Previous
fi: Valitse Edellinen

source: Share...
fi: Jaa...

source: Size
fi: Koko

source: Step %lld of %lld
fi: Vaihe %lld / %lld

source: Steps
fi: Vaiheet

source: Steps:
fi: Vaiheet:

source: Stop Generation
fi: Pysäytä generointi

source: Support Me ♥
fi: Tue minua ♥

source: This may take up to 2 minutes if a model is used for the first time
fi: Tämä voi kestää enintään 2 minuuttia, jos mallia käytetään ensimmäisen kerran

source: Use GPU
fi: Käytä GPU

source: Use Neural Engine
fi: Käytä Neural Engine

source: Uses the model's safety checker module. This does not guarantee that all inappropriate images will be filtered.
fi: Käyttää mallin turvatarkistusmoduulia. Tämä ei takaa, että kaikki sopimattomat kuvat suodatetaan.

source: Website
fi: Nettisivu

source: Width:
fi: Leveys:
